{"pages":[{"title":"","text":"importScripts('https://cdn.onesignal.com/sdks/OneSignalSDKWorker.js');","link":"/OneSignalSDKWorker.js"},{"title":"","text":"{\"gcm_sender_id\":\"482941778795\",\"gcm_sender_id_comment\":\"Do not change the GCM Sender ID\"}","link":"/manifest.json"},{"title":"","text":"importScripts('https://cdn.onesignal.com/sdks/OneSignalSDKWorker.js');","link":"/OneSignalSDKUpdaterWorker.js"},{"title":"About","text":"I build this site to help people handle new stuffs. All suggestions are welcome.","link":"/about/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"},{"title":"Cookie Policy","text":"Information about our use of cookiesOur Website uses cookies to distinguish you from other users of our Website. This helps us to provide you with a good experience when you use our Website and also allows us to improve our Website. By continuing to use our Website, you are agreeing to our use of cookies. Check the User Agreement for the meaning of defined words (those with capital letters). A cookie is a small file of letters and numbers that we store on your browser or the hard drive of your computer. Cookies contain information that is transferred to your computer’s hard drive. We use the following cookies: Strictly necessary cookiesThese are cookies that are required for the operation of our Website. They include, for example, cookies that enable you to log into secure areas of our Website. Examples:JSESSIONIDusrAnalytical/performance cookiesThey allow us to recognise and count the number of visitors and to see how visitors move around our Website when they are using it. This helps us to improve the way our Website works, for example, by ensuring that users are finding what they are looking for easily. Examples:analyticsFunctionality cookiesThese are used to recognise you when you return to our Website. This enables us to personalise our content for you, greet you by name and remember your preferences (for example, your choice of language or region). Examples:exptw-reftw-ref-usertw-ref-user-idlocaleDatafxuserTargeting cookiesThese cookies record your visit to our Website, the pages you have visited and the links you have followed. We will use this information to make our Website and the advertising displayed on it more relevant to your interests. We may also share this information with third parties for this purpose. Examples:gidPlease note that third parties (including, for example, advertising networks and providers of external services like web traffic analysis services) may also use cookies, over which we have no control. These cookies are likely to be analytical/performance cookies or targeting cookies. You block cookies by activating the setting on your browser that allows you to refuse the setting of all or some cookies. However, if you use your browser settings to block all cookies (including essential cookies) you may not be able to access all or parts of our Website. Except for essential cookies, all cookies will expire after 10 years.","link":"/cookie-policy/index.html"},{"title":"Privacy Policy","text":"Privacy Policylalawe is concerned about privacy issues and wants you to understand how we collect, use, disclose, and process your information. This Privacy Policy describes our practices in connection with information that we collect through our websites from which you are accessing this policy, including lalawe.com (the “Websites”), through the software applications made available by us for use on or through computers and mobile devices (the “Apps”), as well as through HTML-formatted email messages that we send to you that link to this Privacy Policy (collectively, including the Websites and Apps, the “Services”). For the purposes of this Privacy Policy, “Personal Information” means information about an identified or identifiable individual, excluding business contact information. By providing Personal Information, or other information, to us or using our Services, you confirm that you understand and consent to the collection, use, disclosure, and processing of your Personal Information and other information (or the Personal Information or other information of any other individual you provide) in the manner as set forth in this Privacy Policy, and you understand that this Privacy Policy is legally binding when you use our Services. Check the Customer Agreement for the meaning of defined words (those with capital letters) that are not defined in this Privacy Policy. Information we may collect about youWe collect your Personal Information and other information when you provide it to us, when you use the Services and when you register for the Services (e.g., a lalawe Account). We may collect the following Personal Information from you: your name, mailing address, email address, phone number, financial information (including credit card, debit card, bank account information or bank account login credentials), occupation, personal description and photograph. We must by law confirm your identity in order to provide certain Services to you e.g., if you send or receive certain high-value or high volume transactions, or as needed to comply with our obligations under applicable laws and regulations, including but not limited to our anti-money laundering obligations. In order to meet our compliance requirements, we may need to collect valid identification documents, such as a copy of your driver’s license, passport or similar identity document, and/or additional commercial and/or financial information from you as required. If you submit Personal Information relating to other people to us or to our service providers in connection with the Services, you warrant that you have obtained the necessary consents from such individual and have authority to disclose his/her Personal Information to us, as well as his/her consent to our collection, use and disclosure of such personal data, for the purposes set forth in this Privacy Policy. Technical Information we collect: details of you carry out on our Website or when using our Services, including geographic location from which the transaction originates;technical information, including the Internet Protocol (IP) address used to connect your computer to the Internet, your login information, browser type and version, time zone setting, browser plug-in types and versions, operating system and platform;information about your visit, including the full Uniform Resource Locators (URL) clickstream to, through or from our Website (including date and time); products you viewed or searched for; page response times, download errors, length of visits to certain pages, page interaction information (such as scrolling, clicks, and mouse-overs), and methods used to browse away from the page and any phone number used to call our Customer Support number.We may aggregate Personal Information.Such aggregated information does not personally identify you or any other user of the Services. For example, we may aggregate Personal Information to calculate the percentage of our users who have a particular telephone area code. Information we receive from other sources.We may receive information about you if you use any of the other websites we operate or the other services we provide. We are also working closely with third parties and may receive information about you from them for example, banks and payment service providers you use to transfer money to us; banks and payment service providers of your recipient; business partners; sub-contractors in technical, payment and delivery services; advertising networks; analytics providers; search information providers; and credit reference agencies; public databases; and social media platforms. If you log in to our Services using your social media account (for example, Facebook or Google) we will receive relevant information that is necessary to enable our Services and authenticate you. The social media network will provide us with access to certain information that you have provided to them, including your name, profile image and e-mail address. We use such information, together with any other information you directly provide to us when registering or using our Services, to create your account and to communicate with you about the information, products and services that you request from us. You may also be able to specifically request that we have access to the contacts in your social media account so that you can send a referral link to your family and friends. We will use, disclose and store all of this information in accordance with this privacy policy. Cookies and similar technologies.Our Website uses cookies, some of which may collect your Personal Information or Technical Information, to distinguish you from other users of our Website. This helps us to provide you with a good experience and also allows us to improve our Website. Cookies allow us to collect information such as browser type, time spent on the Website, pages visited, language preferences, and other anonymous traffic data. We and our service providers use the information for security purposes, to facilitate navigation, to display information more effectively, to personalize your experience while using the Services and to recognize your computer in order to assist your use of the Services. We also gather statistical information about the use of the Services in order to continually improve their design and functionality, understand how they are used and assist us with resolving questions regarding them. Cookies further allow us to select which of our advertisements or offers are most likely to appeal to you and display them while you are on the Services. We may also use cookies or other technologies to track responses to our online advertisements. If you do not want information collected through the use of cookies, there is a simple procedure in most browsers that allows you to automatically decline cookies or be given the choice of declining or accepting the transfer to your computer of a particular cookie (or cookies) from a particular site. You may also wish to refer to www.allaboutcookies.org/manage-cookies/index.html. If, however, you do not accept cookies, you may experience some inconvenience in your use of the Services. For example, we may not be able to recognize your computer, and you may need to login every time you visit. At this time we do not respond to browser do-not-track signals. Pixel tags (also known as web beacons and clear GIFs) may be used in connection with the Services to, among other things, track the actions of users (including email recipients), measure the success of our marketing campaigns and compile statistics about usage of the Services and response rates. We may use third-party analytics providers, such as Google Analytics and Mixpanel, which use cookies and similar technologies to collect and analyze information about use of the Services and report on activities and trends. These third parties may also collect information regarding the use of other websites, apps and online resources. You can learn about Google’s practices by going to www.google.com/policies/privacy/‌partners, and opt out of them by downloading the Google Analytics opt-out browser add-on, available at tools.google.com/dlpage/gaoptout. You can learn about Mixpanel’s practices by going to mixpanel.com/terms/ and opt-out by visiting mixpanel.com/optout. Third Party Advertisers.We may use third-party advertising companies to serve advertisements regarding goods and services that may be of interest to you when you access and use the Services and other websites, apps or online services, based on information relating to your access to and use of the Services and other websites, apps or online services on any of your devices. To do so, these companies may place or recognize a unique cookie on your browser (including through use of pixel tags). They may also use these technologies, along with information they and we collect about your online use, to recognize you across the devices you use, such as a mobile phone and a laptop. If you would like more information about this practice, and to learn how to opt out of it in desktop and mobile browsers on the particular device on which you are accessing this Privacy Policy, please visit optout.networkadvertising.org/ and www.aboutads.info/. You may also download the AppChoices app at youradchoices.com/appchoices to opt out in mobile apps. Use and disclosure of the informationWe may use your Personal Information in the following ways: to carry out our obligations relating to your contracts and transactions with us and to provide you with the information, products and services that you request from us, as well as related customer service;to notify you about changes to our Services or to send you other administrative information;as part of our efforts to keep our Services safe and secure;to administer our Services and for internal operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes;to improve our Website and to ensure other Services are presented in the most effective manner;to measure or understand the effectiveness of advertising we serve and to deliver relevant advertising to you;to allow you to participate in interactive features of our Services, when you choose to do so;to facilitate social sharing functionality;consistent with choices that may be available to you, to provide you with information about other similar goods and services we offer; andto provide you, or permit selected third parties to provide you, with information about goods or services we feel may interest you.We may also use and disclose Personal Information as we believe necessary or appropriate: (a) to comply with any applicable legal and/or regulatory requirements, including laws outside your country of residence; (b) to comply with legal process; (c) to respond to requests from public and government authorities, including public and government authorities outside your country of residence, upon demonstration of lawful authority; (d) to enforce our Customer Agreement with you; (e) as part of our efforts to keep our Services safe and secure, including to protect our rights, privacy, safety or property, and/or that of our affiliates, you or others, and to investigate, prevent, detect or suppress fraud; and (f) to allow us to pursue available remedies or limit the damages that we may sustain. We may use and disclose Technical Information for any purpose, except where we are required to do otherwise under applicable law. If we are required to treat Technical Information as Personal Information under applicable law, then we may use it for the purposes for which we use and disclose Personal Information as detailed in this Privacy Policy. If we combine Technical Information with Personal Information, we will treat the combined information as Personal Information as long as it is combined. We may disclose and share your Personal Information with selected third parties including: affiliates, business partners, joint marketers, suppliers and sub-contractors for the performance of any contract we enter into with them or you;advertisers and advertising networks solely to select and serve relevant advertisements to you and others;to third party service providers that connect to your bank account(s) with bank account login credentials provided by you in order for us to perform Services and confirm availability of funds; andanalytics and search engine providers that assist us in the improvement and optimization of our site.Your Personal Information may also be disclosed: consistent with choices that may be available to you, to our affiliates for the purposes described in this Privacy Policy;consistent with choices that may be available to you, to permit selected third parties to provide you with information about goods or services;by you, on message boards, chat, profile pages and blogs and other services to which you are able to post information and materials. Please note that any information you post or disclose through these services will become public and may be available to other users and the general public;to your friends associated with your social media account, to other users of the Services and to your social media account provider, in connection with your social sharing activity, such as if you connect your social media account to your Services account or log into your Services account from your social media account. By connecting your Services account and your social media account, you authorize us to share information with your social media account provider, and you understand that the use of the information we share will be governed by the social media site’s privacy policy;if you open or access your TransferWise Account directly on a third party website or via a third party application, with the provider of the third party website or application;to explore and/or undertake a corporate transaction, including any reorganization, merger, sale, joint venture, assignment, transfer or other disposition of all or any portion of our business, assets or stock (including in connection with any bankruptcy or similar proceedings);if we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply our Customer Agreement and other applicable agreements; or to protect the rights, property, or safety of TransferWise, our customers, or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection and credit risk reduction;to assist us in conducting or co-operating in investigations of fraud or other illegal activity, or to respond to requests from public and government authorities (including those outside your country of residence), upon demonstration of lawful authority;to prevent and detect fraud or crime;in response to a subpoena, warrant, court order, or as otherwise required by law;to assess financial and insurance risks, and to protect our operations and those of any of our affiliates;to allow us to pursue available remedies or limit the damages that we may sustain;to recover debt or in relation to your insolvency; andto develop customer relationships, services and systems.Your Choices Regarding our Use of your Personal InformationIf you no longer want to receive marketing-related emails from us on a going-forward basis, you may opt-out by following the instructions in any such email. We will try to comply with your request(s) as soon as reasonably practicable. Please note that if you opt-out, we may still send you important administrative messages, from which you cannot opt-out. Your Rights – Access to and Correction of Personal InformationYou have the following rights regarding your Personal Information in our possession or under our control: Upon request, be informed of the existence, use and disclosure of your Personal Information and be given access to that information.Challenge the accuracy and completeness of your Personal Information and have it amended as appropriate. Depending on the nature of the information, amendment may involve the correction, deletion or addition of information.Withdraw your consent to the collection, use or disclosure of your Personal Information.You may contact us at zzycn2013@gmail.com to make a request. We will respond to a request as soon as reasonably practicable. We may need to verify your identity before addressing your request. An access request may be subject to a fee. If the request is unfounded, unlawful or excessive, we may refuse the request. Please note that we may need to retain certain information for recordkeeping purposes, to comply with our obligations under applicable laws and regulations, including but not limited to our anti-money laundering obligations, and/or to complete any transactions that you began prior to requesting a change or deletion. How do we protect your Personal InformationYour Personal Information is protected by security safeguards appropriate to the level of sensitivity of the information through (i) physical measures, such as secure areas; (ii) technical measures, such as encryption and secure servers; and (iii) organizational measures, such as due diligence in transferring Personal Information to third-party processors. Unfortunately, no data transmission or storage system can be guaranteed to be 100% secure. If you have reason to believe that your interaction with us is no longer secure (for example, if you feel that the security of your account has been compromised), please immediately notify us in accordance with the “Contact” section below. For more information about security, please see the Account Security and Privacy and Information Security sections of the Customer Agreement. Cross-Border Transfer.We may transfer your Personal Information to a third-party service provider for processing and storage. Whenever we engage a third-party service provider, we ensure that the information is properly safeguarded at all times at a comparable level of protection the information would have received if it had not been transferred. Your Personal Information may be stored and processed in any country where we have facilities or in which we engage service providers, and by using the Services you consent to the transfer of information to countries outside of Canada, including the United States, which may have different data protection rules. In the event that your Personal Information is transferred outside of Canada, the government, courts or law enforcement or regulatory agencies of that jurisdiction may be able to obtain disclosure of your Personal Information through the laws of that jurisdiction. Third Party ServicesOur Services may, from time to time, contain links to and from the websites of our partner networks, advertisers, affiliates, and others. The inclusion of a link on the Services does not imply endorsement of the linked site or service by us. If you follow a link to any of these websites, please note that we are not responsible for the privacy, these websites have their own privacy policies and that we do not accept any responsibility for them. Please check these policies before you submit any personal data to these websites. In addition, we are not responsible for the information collection, use, disclosure or security policies or practices of other organizations, such as Apple, Google, Microsoft, RIM or any other app developer, app provider, operating system provider, wireless service provider or device manufacturer, including with respect to any Personal Information you disclose to other organizations through or in connection with the Apps. Use of Services by MinorsThe Services are not directed to individuals under the age of eighteen (18), and we request that they not provide Personal Information through the Services. Changes to our Privacy PolicyWe may change this Privacy Policy. The “Last Updated” legend at the top of this page indicates when this Privacy Policy was last revised. Any changes we may make to our Privacy Policy will become effective when we post the revised Privacy Policy on the Services. Your use of the Services following these changes means that you accept the revised Privacy Policy. ContactQuestions, comments and requests regarding this Privacy Policy are welcomed and should be sent to: zzycn@2013.gmail. Because email communications are not always secure, please do not include credit card or other sensitive information in your emails to us.","link":"/privacy-policy/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"}],"posts":[],"tags":[],"categories":[]}